In [2]:
import seaborn as sns
df= sns.load_dataset('titanic')
df

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [3]:
X=df[['fare', 'pclass']]
Y=df[['survived']]
X.shape, Y.shape

((891, 2), (891, 1))

In [4]:
from sklearn. preprocessing import StandardScaler
scaler=StandardScaler()
scaler.fit(X)
X= scaler.transform(X)
X, X.shape

(array([[-0.50244517,  0.82737724],
        [ 0.78684529, -1.56610693],
        [-0.48885426,  0.82737724],
        ...,
        [-0.17626324,  0.82737724],
        [-0.04438104, -1.56610693],
        [-0.49237783,  0.82737724]]), (891, 2))

In [5]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(X,Y)

In [6]:
from sklearn.linear_model import LogisticRegression
logR= LogisticRegression()
logR.fit(x_train,y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [7]:
logR.score(x_train, y_train)

0.6646706586826348